---
kind: property
id: P:Autodesk.Revit.DB.Analysis.AnalysisDisplayColoredSurfaceSettings.ShowGridLines
source: html/809dd21e-0783-3ce9-b30d-9bc4fbeba123.htm
---
# Autodesk.Revit.DB.Analysis.AnalysisDisplayColoredSurfaceSettings.ShowGridLines Property

If true, show grid lines in the analysis display.

## Syntax (C#)
```csharp
public bool ShowGridLines { get; set; }
```